[
{"id":"1","name":"C","department_id":"1","year":"1","subject_image":"Screenshot_2020-11-15-11-47-44-76.jpg","description":"C is a general-purpose, procedural computer programming language supporting structured programming, lexical variable scope, and recursion, with a static type system.","level":false},
{"id":"2","name":"Machine Design","department_id":"4","year":"3","subject_image":"machine design.jpg","description":" A Machine design is the process of engineering design. A machine is made up of mechanisms that work together to satisfy the requirements of what the machine needs to accomplish.","level":false},
{"id":"3","name":"Mathematics - I","department_id":"2","year":"1","subject_image":"unnamed.png","description":"Engineering mathematics is a branch of applied mathematics concerning mathematical methods and techniques that are typically used in engineering and industry.","level":false},
{"id":"5","name":"Furnace Technology ","department_id":"5","year":"2","subject_image":"furnance_technology_metallurgy_4tthsem.jpg","description":"Furnace technology is focused in the area of improving energy efficiency, which helps with both cost reduction and creating a greener impact. This is one reason why it is often worth investing in new, more energy efficient  furnaces. ","level":false},
{"id":"6","name":"Powder metallurgy","department_id":"5","year":"2","subject_image":"powder_metallurgy_mt_4thsem.jpeg","description":"Powder metallurgy is a metal-forming process performed by heating compacted metal powders to just below their melting points. Although the process has existed for more than 100 years, over the past quarter century it has become widely recognized as a superior way of producing high-quality parts.","level":false},
{"id":"7","name":"Java programming 1","department_id":"2","year":"2","subject_image":"java1.jpg","description":"Java is a high-level programming language developed by Sun Microsystems. ... The Java syntax is similar to C++, but is strictly an object-oriented programming language.","level":false},
{"id":"8","name":" Elements of physical metallurgy","department_id":"5","year":"2","subject_image":"elements_physical_met_mt_4thsem.jpg","description":"Physical metallurgy is one of the two main branches of the scientific approach to metallurgy, which considers in a systematic way the physical properties of metals and alloys. It is basically the fundamentals and applications of the theory of phase transformations in metal and alloys.","level":false},
{"id":"9","name":"Steel making","department_id":"5","year":"2","subject_image":"steel_making_mt_4thsem.jpg","description":"Steelmaking is the process of producing steel from iron ore and\/or scrap. In steelmaking, impurities such as nitrogen, silicon, phosphorus, sulfur and excess carbon (the most important impurity) are removed from the sourced iron,","level":false},
{"id":"10","name":"Extraction of non ferrous metals","department_id":"5","year":"2","subject_image":"enfm_mt_4thsem.jpg","description":"Non-ferrous extractive metallurgy is one of the two branches of extractive metallurgy which pertains to the processes of reducing valuable, non-iron metals from ores or raw material.","level":false},
{"id":"11","name":"Software Testing ","department_id":"2","year":"3","subject_image":"software-testing-logo-png-2.png","description":"Software engineering is a branch of computer science which includes the development and building of computer systems software and applications software.","level":false},
{"id":"12","name":"SMFA","department_id":"5","year":"3","subject_image":"smfa_mt_6thsem.jpg","description":"It stands for  Selection of material and failure analysis. Material selection is the act of choosing the material best suited to achieve the requirements of a given application. Failure analysis is when an investigation takes place to determine the cause of failure.","level":false},
{"id":"13","name":"Programming in PHP","department_id":"2","year":"2","subject_image":"PHP_logo.png","description":"PHP is a general-purpose scripting language geared towards web development.","level":false},
{"id":"14","name":"Modern foundry engineering ","department_id":"5","year":"3","subject_image":"foundry_eng_6thsem.jpg","description":"Foundry engineering is the profession revolving around designing new foundries. Engineers custom create a building made for heating raw materials to incredible temperatures in order to pour them into molds and create a product that can be sold.","level":false},
{"id":"15","name":"Server side scripting using PHP","department_id":"2","year":"3","subject_image":"PHP_logo.png","description":"Server-side scripting occurs in web development. It involves scripts that are processed at the web server to produce a customized user response.","level":false},
{"id":"16","name":"Client side scripting using javascript","department_id":"2","year":"2","subject_image":"logo-javascript-clipart-1.jpg","description":"Client-side scripting, like JavaScript, can be embedded into the page on the client’s browser. This script will allow the client’s browser to alleviate some of the burden on your web server when running a web application.","level":false},
{"id":"17","name":"Network Management and Administration","department_id":"2","year":"3","subject_image":"network management and administration.jpg","description":"Network management is the sum total of applications, tools and processes used to provision, operate, maintain, administer and secure network infrastructure.","level":false},
{"id":"18","name":"Data Communication and Networking","department_id":"2","year":"2","subject_image":"data_communication_and networking.jpg","description":"Data Communication & Computer Network, Data communications refers to the transmission of this digital data between two or more computers and a computer network or data network is a telecommunications","level":false},
{"id":"19","name":"E-commerce","department_id":"2","year":"3","subject_image":"e-commerce.jpg","description":"E-commerce (electronic commerce) is the activity of electronically buying or selling of products on online services or over the Internet.","level":false},
{"id":"20","name":"Data Structures","department_id":"2","year":"2","subject_image":"data structures.jpg","description":" Data Structures are a specialized means of organizing and storing data in computers in such a way that we can perform operations on the stored data more efficiently.","level":false},
{"id":"21","name":"Computer Security","department_id":"2","year":"2","subject_image":"computer security.jpg","description":"Computer security, cybersecurity or information technology security (IT security) is the protection of computer systems and networks from information disclosure, theft of or damage","level":false},
{"id":"22","name":"Entrepreneurship and Startups","department_id":"2","year":"2","subject_image":"entreprenuership.jpg","description":"The Startup Entrepreneurship specialization focuses on issues of Innovation, Creativity and Entrepreneurship.","level":false},
{"id":"23","name":"Java programming 2","department_id":"2","year":"3","subject_image":"java2.png","description":"Java is a high-level programming language developed by Sun Microsystems. ... The Java syntax is similar to C++, but is strictly an object-oriented programming language.","level":false},
{"id":"24","name":"Kids garment manufacturing","department_id":"8","year":"1","subject_image":"1628950587598.jpg","description":"Kid’s garments manufacturing is certainly a promising and profitable venture within the Indian clothing or apparel industry. The Indian Textile Industry is one of the essential textile industries within the world","level":false},
{"id":"25","name":"Communation skils 2","department_id":"8","year":"1","subject_image":"1628950587543.jpg","description":"Communication Skills II is a comprehensive textbook tailored to meet the syllabus requirements of undergraduate engineering students of VTU. Written in a student friendly manner, the chapters are supplemented with numerous examples and practice exercises.","level":false},
{"id":"26","name":" Textile science-1","department_id":"8","year":"1","subject_image":"1628950587506.jpg","description":"Textiles are an indispensable part of human life. Besides the apparel industry, textiles also find use as industrial filters and geotextiles, fireproof clothing and covering and in the making of backpacks, tents and nets. ","level":false},
{"id":"28","name":"Textile chemistry","department_id":"8","year":"1","subject_image":"textile_chemistry_ddgm_2ndsem.jpg","description":"Textile Chemistry is the applied form of Chemistry. It is an application of basic knowledge of chemistry to understand textile materials. Eventually, the textile chemists artistically modify the materials into various items that can be used by manufacturers for different purposes","level":false},
{"id":"29","name":"Fashion merchandising","department_id":"8","year":"2","subject_image":"1628950587580.jpg","description":"Fashion merchandising can be defined as the planning and promotion of sales by presenting a product to the right market at the proper time, by carrying out organized, skillful advertising, using attractive displays, etc. ","level":false},
{"id":"30","name":"Draping techniques","department_id":"8","year":"2","subject_image":"1628950587524.jpg","description":"Draping is the art of using cotton muslin to create a fashion design directly on a mannequin. It is an essential skill for fashion designers. In this book, Karolyn Kiisel presents a series of step-by-step projects, creating real garments in classic styles.","level":false},
{"id":"31","name":"Appreciation of Indian coustume ","department_id":"8","year":"2","subject_image":"india_custome_4thsem_ddgm.jpg","description":"Clothing in India is dependent upon the different ethnicity, geography, climate, and cultural traditions of the people of each region of India. Historically, male and female clothing has evolved from simple garments like kaupina, langota, achkan, etc.","level":false},
{"id":"32","name":"Surface techniques ","department_id":"8","year":"2","subject_image":"surface_techniques_ddgm_4thsem.jpg","description":"Surface design as any technique that manipulates or changes the surface of a fabric. This would include: painting, dyeing, printing\/stamping, stenciling, applying resists, stitching, embellishing (e.g. adding beads), collaging, weaving, etc.","level":false},
{"id":"33","name":"Fashion forecasting","department_id":"8","year":"3","subject_image":"1628950587562.jpg","description":"Fashion forecasting is a global career that focuses on upcoming trends. A fashion forecaster predicts the colors, fabrics, textures, materials, prints, graphics, beauty\/grooming, accessories, footwear, street style, and other styles.","level":false},
{"id":"34","name":"Retail Promotion","department_id":"8","year":"3","subject_image":"retail_promotion_ddgm_6thsem.jpg","description":"A retail promotion is a persuasive marketing strategy designed to drive sales. Most retail promotions appeal to logic and urgency. They communicate to consumers, This is a great deal, and you don't want to miss out.","level":false},
{"id":"35","name":"Embroidery in India ","department_id":"8","year":"1","subject_image":"embroiders_of_inida_ddgm.jpg","description":"Embroidery in India includes dozens of  embroidery  styles that vary by region and  clothing styles. Designs in Indian embroidery are formed on the basis of the texture and the design of the fabric and the stitch. ","level":false},
{"id":"36","name":"History of Fashion - 2","department_id":"8","year":"2","subject_image":"history_of_fashion_ddgm.jpg","description":"History of fashion design refers specifically to the development of the purpose and intention behind garments, shoes and accessories, and their design and construction. The modern industry, based around firms or fashion houses run by individual designers.","level":false},
{"id":"37","name":" Elements of textile","department_id":"8","year":"1","subject_image":"elements_of_textile_ddgm.jpg","description":"The elements of design serve as a foundation for the development and creation of all textiles and clothing products, including fabrics for interior spaces. Throughout history artisans and designers have utilized the elements of design.","level":false},
{"id":"38","name":" Color Theory","department_id":"8","year":"2","subject_image":"color_theory_ddgm.jpg","description":"Color theory is the collection of rules and guidelines which designers use to communicate with users through appealing color schemes in visual interfaces. To pick the best colors every time, designers use a color wheel and refer to extensive collected knowledge about human optical ability, psychology, culture and more.  ","level":false},
{"id":"39","name":"Apparel manufacturing technology ","department_id":"8","year":"2","subject_image":"apprel_manu_technoilgy_ddgm.jpg","description":"Apparel manufacturing process starts from raw material selection to packaging and dispatch of goods. Further, engineering practices followed in an apparel industry for production planning and control, line balancing, implementation of industrial engineering concepts in apparel manufacturing","level":false},
{"id":"40","name":"Java programming 2","department_id":"2","year":"3","subject_image":"java2.png","description":"Java is a high-level programming language developed by Sun Microsystems. ... The Java syntax is similar to C++, but is strictly an object-oriented programming language.","level":false},
{"id":"41","name":"Computer Networks","department_id":"1","year":"2","subject_image":"computer network1.jpg","description":"A computer network is a group of computers that use a set of common communication protocols over digital interconnections for the purpose of sharing resources located on or provided by the network nodes.","level":false},
{"id":"42","name":"Surveying II","department_id":"3","year":"2","subject_image":"surveying I.jfif","description":"Surveying is the general term, which covers a myriad of disciplines, such as Geodesy, Photogrammetry, Cartography, GIS, Digital Mapping, Cadastral Surveying, etc. Modern Surveying topics include digital mapping, geodesy, photogrammetry, remote sensing, as well as more  traditional surveying involving property surveys.","level":false},
{"id":"43","name":"Advanced Computer Networks","department_id":"1","year":"3","subject_image":"acn2.png","description":"In the course advanced Internet procedures and technologies are described which support an efficient, effective and secure interconnection of both distributed applications and related structured data","level":false},
{"id":"44","name":"C++","department_id":"1","year":"2","subject_image":"cpp1.png","description":"C++ is a statically typed, compiled, general-purpose, case-sensitive, free-form programming language that supports procedural, object-oriented, and generic programming.","level":false},
{"id":"45","name":"Data Structures","department_id":"1","year":"2","subject_image":"data structures.jpg","description":"More precisely, a data structure is a collection of data values, the relationships among them, and the functions or operations that can be applied to the data.","level":false},
{"id":"46","name":"Design of Steel Structures","department_id":"3","year":"2","subject_image":"Design of Steel Structures.jfif","description":"In this course, the student will study elements of steel structures. They will be introduced to basic structural steel elements - structural connections, tension members, compression members, column bases, and roof trusses along with the concepts of their designs.","level":false},
{"id":"47","name":"Digital Marketing ","department_id":"1","year":"2","subject_image":"digital marketing.jpg","description":"The objective of digital marketing is to develop strong and innovative strategies to promote the business brand, products, and services. ","level":false},
{"id":"48","name":"Highway and Bridge Enginnering","department_id":"3","year":"2","subject_image":"Highway and Bridge Enginnering.jfif","description":"This subject is an engineering discipline branching from civil engineering that involves the planning, design, construction, operation, and  maintenance of  roads, bridges, and tunnels to ensure safe and effective transportation of people and goods.","level":false},
{"id":"49","name":"Advanced construction techniques","department_id":"3","year":"2","subject_image":"Advanced construction techniques.jpg","description":"By studying this course the student will be aware of advanced construction procedures & techniques required for above construction structures with special reference to various operations related with concrete","level":false},
{"id":"50","name":"Digital Techniques","department_id":"1","year":"2","subject_image":"dt1.jpg","description":"Digital techniques make it possible to remove things that would never have ... at all times but time-multiplexing the flow of information to allow different units to ","level":false},
{"id":"52","name":"Java programming 1","department_id":"1","year":"3","subject_image":"java1.jpg","description":"Java is a high-level programming language developed by Sun Microsystems. ... The Java syntax is similar to C++, but is strictly an object-oriented programming language.","level":false},
{"id":"53","name":"Java programming 2","department_id":"1","year":"3","subject_image":"java2.png","description":"Java is a high-level programming language developed by Sun Microsystems. ... The Java syntax is similar to C++, but is strictly an object-oriented programming language.","level":false},
{"id":"54","name":"Java Script","department_id":"1","year":"3","subject_image":"logo-javascript-clipart-1.jpg","description":"JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions. While it is most well-known as the scripting language for Web pages,","level":false},
{"id":"55","name":"Computer Graphics","department_id":"1","year":"2","subject_image":"computer-graphics1l.png","description":"Computer graphics is a sub-field of computer science which studies methods for digitally synthesizing and manipulating visual content. ","level":false},
{"id":"56","name":"Computer peripherals and hardware management ","department_id":"1","year":"2","subject_image":"cphm2.jpg","description":"Peripherals are the input, output and storage hardware for computers. Touchscreens are both inputs and outputs. ","level":false},
{"id":"57","name":"Fundamentals of electrical engeneering","department_id":"1","year":"2","subject_image":"electrical2.jpg","description":" Electrical engineering is the branch of engineering that deals with the technology of electricity, including circuitry, power generation, machine control and communications.","level":false},
{"id":"58","name":"Irrigation Engineering","department_id":"3","year":"2","subject_image":"Irrigation Engineering.JPG","description":"Irrigation Engineering is a sub branch that comes under civil engineering and it deals with the study of monitoring and restraining of the  several sources of water.","level":false},
{"id":"59","name":"Fundamentals of electronics","department_id":"1","year":"1","subject_image":"electronic1.jpg","description":"Electronics comprises the physics, engineering, technology and applications that deal with the emission, flow and control of electrons in vacuum and matter. ","level":false},
{"id":"61","name":"HTML(Hyper Text Markup Language)","department_id":"1","year":"1","subject_image":"html1.png","description":"The HyperText Markup Language, or HTML is the standard markup language for documents designed to be displayed in a web browser. It can be assisted by technologies such as Cascading Style Sheets (CSS) and scripting languages such as JavaScript","level":false},
{"id":"62","name":"Linux","department_id":"1","year":"1","subject_image":"linux.jpg","description":"is a family of open-source Unix-like operating systems based on the Linux kernel, an operating system kernel first released on September 17, 1991, by Linus Torvalds.","level":false},
{"id":"63","name":"Engeneering Mathematics 1","department_id":"1","year":"1","subject_image":"maths1.jpg","description":"includes the study of such topics as quantity (number theory), structure (algebra), space (geometry), and change (analysis). ","level":false},
{"id":"64","name":" Soil Mechanics","department_id":"3","year":"2","subject_image":"Soil Mechanics.jpg","description":"All Civil Engineering structures are restimg on soil base. Hence the knowledge of soil and its behaviour is essential for technicians. In laboratory the experiments integrate the knowledge and developed desired skills in the students .","level":false},
{"id":"65","name":"Contracts and Accounts","department_id":"3","year":"2","subject_image":"Contracts and Accounts.jpg","description":"The Students will learn concepts, principles and procedures of Contracts and Accounts. The students will understand the procedure for execution of Civil Engineering works in Government and private sector. The student will know procedure for preparing Tender documents. ","level":false},
{"id":"66","name":"Theory of Structure","department_id":"3","year":"2","subject_image":"Theory of Structure.jfif","description":"Concepts and principles involved in the design of various structures are covered in this subject. The application of theoretical concepts & principles in practical field situations is essential.","level":false},
{"id":"67","name":"Construction Management","department_id":"3","year":"2","subject_image":"Construction Management.jpg","description":"The Civil Engineer has to plan, Manage and execute Civil Engineering works. He has to manage different resources. He should have knowledge of basic management of basic management processes related to Civil engineering field.","level":false},
{"id":"68","name":"Environmental Engineering","department_id":"3","year":"2","subject_image":"Environmental Engineering.jpg","description":"This course is an attempt to present those essential principles and present day practices necessary to the solution of the problems of water collection, water purification and water distribution.","level":false},
{"id":"69","name":"Hydraulics","department_id":"3","year":"2","subject_image":"hydraulics.jpg","description":"The subject of hydraulics is a basic science and application for many Civil Engineering subjects like Irrigation, Water Supply, Sanitary Engineering, and Transportation Engineering etc.","level":false},
{"id":"70","name":"Railway and Tunnel Engineering","department_id":"3","year":"2","subject_image":"Railway and Tunnel Engineering.jpg","description":"This course has been framed with a view to familiarize the students with the terminology, components, construction techniques and maintenance operations used in Railway and Tunnel Engineering","level":false},
{"id":"71","name":"Engeneering Mathematics 2","department_id":"1","year":"1","subject_image":"maths2.png","description":" It has no generally accepted definition. Mathematicians seek and use patterns to formulate ...","level":false},
{"id":"72","name":"Concrete Technology","department_id":"3","year":"2","subject_image":"Concrete Technology.jpg","description":"Concrete is the most widely used construction material in all types of Civil Engineering structures . A Civil Engineering technician has to plan , supervise and ensure the quality of final product of concrete , i.e. its durability , strength , tolerance , appearance and finish.","level":false},
{"id":"73","name":"CAD and Computer Applications","department_id":"3","year":"2","subject_image":"Cad and computer Applications.jpg","description":"Diploma engineer student must know more about computer operation & its applications. In order to work in software engineering fields in Civil Engineering the student must know drafting methodologies and their applications to various Civil Engineering fields.","level":false},
{"id":"74","name":"Analysis and design of RC structure","department_id":"3","year":"2","subject_image":"Analysis and design of RC structure.jpg","description":"While working as a supervisor, the diploma student should be aware of the basic concepts of RCC design & should be able to prepare, read, interpret structural drawings. The student should be familiar with relevant IS codes & be aware of the standard requirements, while executing the construction work. He should be also capable of designing simple structures.","level":false},
{"id":"75","name":"Engeneering Mathematics 3","department_id":"1","year":"2","subject_image":"M3.jpg","description":" Mathematics, the science of structure, order, and relation that has evolved from counting, measuring, and describing the shapes of objects.","level":false},
{"id":"76","name":"Thermal Engineering","department_id":"4","year":"2","subject_image":"Thermal Engineering.jpg","description":"Thermal engineering incorporating basic principles of the thermodynamics and heat transfer forms an essential element of any mechanical engineering course these days. In this core area, students will be able to solve many problems related to this and inter areas, because the principles involved have universal applications. ","level":false},
{"id":"77","name":"Fluid Mechanics and Fluid Machinery","department_id":"4","year":"2","subject_image":"FLUID MECHANICS AND FLUID MACHINERY.jpg","description":"Knowledge of fluid pressure, fluid flow and related machinery is essential in all fields of engineering.Hydraulic machines and hydraulic devices have important role in power generation, power transmission, water supply, irrigation and other engineering segments.","level":false},
{"id":"78","name":"Electrical Machines - 1","department_id":"7","year":"2","subject_image":"electrical machines 1.jpg","description":"In electrical engineering, electric machine is a general term for machines using electromagnetic forces, such as electric motors, electric generators, and others. ... The moving parts in a machine can be rotating (rotating machines) or linear (linear machines).","level":false},
{"id":"79","name":"Microprocessor","department_id":"1","year":"1","subject_image":"microprocessor3.jpg","description":"A microprocessor is an electronic component that is used by a computer to do its work. It is a central processing unit on a single integrated circuit chip containing millions of very small components ","level":false},
{"id":"80","name":"Production Planning and Control","department_id":"4","year":"2","subject_image":"Production Planning and Control.jpg","description":"A technician working in production department has to deal with various processes, planning for processes and control for the same for increasing the productivity. This course is being introduced so as to enable the students to work efficiently as a production supervisor, which is the main job area for technicians.","level":false},
{"id":"81","name":"Linear integrated circuits","department_id":"6","year":"2","subject_image":"linear inte circuit.jpg","description":"A linear integrated circuit or analog chip is a set of miniature electronic analog circuits formed on a single piece of semiconductor material.","level":false},
{"id":"82","name":"Operating System","department_id":"1","year":"2","subject_image":"operating system1.jpg","description":"An operating system (OS) is system software that manages computer hardware, software resources, and provides common services for computer programs.","level":false},
{"id":"83","name":"Total Quality Management (TQM)","department_id":"4","year":"2","subject_image":"Total Quality Management.jpg","description":"The mechanical engineers  must have consciousness about various quality aspects required for manufacturing \/service sector.To fulfill this need this subject about various factors and philosophies in quality development is introduced.  So that student will have most of basic inputs before they enter their  profession.","level":false},
{"id":"84","name":"DC machines and transformers","department_id":"7","year":"2","subject_image":"dc machines and trans.JPG","description":"In a motor, the induced emf is called Back Emf (Eb) because it acts opposite to the supply voltage. The DC generator converts the electrical power into electrical power. The magnetic flux in a DC machine is produced by the field coils carrying current.","level":false},
{"id":"85","name":"Elements Of Electrical Engineering ","department_id":"7","year":"2","subject_image":"elements of elec engine.jpg","description":"Current and voltage dividers, resistors, capacitors, inductors, node voltage and mesh current analysis of circuits, Thevenin and Norton equivalents, AC circuits, phasors, impedance, electromagnetic fields, electric power, transformers, magnetic materials, generators and motors, operational amplifiers","level":false},
{"id":"86","name":"Digital Electronics","department_id":"6","year":"2","subject_image":"digital elec.jpg","description":" Image result for Digital Electronics subject Digital electronics is a field of electronics involving the study of digital signals and the engineering of devices that use or produce them.","level":false},
{"id":"87","name":"Transmission and distribution of electrical power","department_id":"7","year":"2","subject_image":"transmission and distri.jpg","description":"Transmission and distribution refers to the different stages of carrying electricity over poles and wires from generators to a home or a business.","level":false},
{"id":"88","name":"Utilization of electrical energy","department_id":"7","year":"2","subject_image":"utilization of electrical.JPG","description":"This subject gives a comprehensive idea in utilization of electrical power such as drives, electric heating, electric welding and illumination, electric traction, electrolysis, refrigeration air- conditioning and automobile electric system.","level":false},
{"id":"89","name":"Network analysis","department_id":"6","year":"2","subject_image":"network analysis.JPG","description":" Image result for Network analysis subject Network Analysis is a process by which we can calculate different electrical parameters of a circuit element connected in an electrical network. ... The circuit elements are resistors, capacitors, inductors, voltage sources, current sources etc","level":false},
{"id":"90","name":"Construction Technology","department_id":"3","year":"2","subject_image":"Construction Technology.jfif","description":"By studying this course the student will be aware of various component parts of a building structure and construction processes which will help him to understand, guide and supervise the construction procedures effectively.","level":false},
{"id":"91","name":"Modern Electric Traction","department_id":"7","year":"2","subject_image":"modern electric traction.jpg","description":"The system which use electrical power for traction system i.e. for railways, trams, trolleys, etc. is called electrical traction. ... The three main types of electric traction systems that exist are as follows: Direct Current (DC) electrification system. Alternating Current (AC) electrification system.","level":false},
{"id":"92","name":"Wireless Communication","department_id":"6","year":"2","subject_image":"wireless communication.JPG","description":"Wireless communication (or just wireless, when the context allows) is the transfer of information between two or more points that do not use an electrical conductor as a medium by which to perform the transfer. The most common wireless technologies use radio waves.","level":false},
{"id":"93","name":"Fundamentals Of Electronics Engineering ","department_id":"6","year":"2","subject_image":"fundamentals of electro engineener.png","description":"Electrical current, voltage, resistance, capacitance, and inductance are a few of the basic elements of electronics and radio. Apart from current, voltage, resistance, capacitance, and inductance, there are many other interesting elements to basic electronics technology.","level":false},
{"id":"94","name":"Generation of electrical power","department_id":"7","year":"2","subject_image":"generation of electrical energy.JPG","description":"Electricity generation is the process of generating electric power from sources of primary energy.","level":false},
{"id":"95","name":"Instrumentation and control","department_id":"7","year":"2","subject_image":"instrumentation and control.JPG","description":" Instrumentation and Control Engineering is an ideal course for students interested in the operating systems and working processes of digital instruments.","level":false},
{"id":"96","name":"Electrical measurements and instruments","department_id":"7","year":"2","subject_image":"elecrctrical measurements and instruments.JPG","description":" An instrument is a device in which we can determine the magnitude or value of the quantity to be measured. The measuring quantity can be voltage, current, power and energy etc.","level":false},
{"id":"97","name":"Applied Electronics ","department_id":"6","year":"2","subject_image":"applied electronics.JPG","description":"Applied Electronics is a wide ranging field encompassing the application of electronics in different areas, such as, manufacturing, medicine, consumer applications and others. With a variety of subjects in the curriculum this course attracts students from many disciplines.","level":false},
{"id":"98","name":"AC and DC circuits","department_id":"7","year":"2","subject_image":"ac dc.jpg","description":"AC & DC electricity are both widely used in electrical and electronic circuits, each being used for different purposes.","level":false},
{"id":"99","name":"Microcontroller and application","department_id":"6","year":"2","subject_image":"micro controllers.JPG","description":"Microcontroller is a compressed micro computer manufactured to control the functions of embedded systems in office machines, robots, home appliances, motor vehicles, and a number of other gadgets","level":false},
{"id":"100","name":"Digital Techniques and applications","department_id":"6","year":"2","subject_image":"digital techniques.JPG","description":"Digital electronics is a field of electronics involving the study of digital signals and the engineering of devices that use or produce them. ","level":false},
{"id":"101","name":"Microwave Communication","department_id":"6","year":"2","subject_image":"microwave communication.jpg","description":"Microwave is a line-of-sight wireless communication technology that uses high frequency beams of radio waves to provide high speed wireless connections that can send and receive voice, video, and data information.","level":false},
{"id":"102","name":"Testing and maintenance of electrical equipments ","department_id":"7","year":"3","subject_image":"testing and maintainence of electrical.JPG","description":"Electrical Preventive Maintenance (EPM) is the prac- tice of conducting routine inspections, tests, and the servicing of electrical equipment so that impending troubles can be detected and reduced, or eliminated.","level":false},
{"id":"103","name":"Computer Network","department_id":"7","year":"2","subject_image":"comp network.png","description":" Simply put, computer networking is the study of how computers can be linked to share data.","level":false},
{"id":"105","name":"Applied Mathematics – I","department_id":"4","year":"1","subject_image":"applied-maths.jpg","description":"The students of Diploma in Engineering and technology must acquire some essential competencies in Mathematics.","level":false},
{"id":"106","name":"Applied Mathematics – II ","department_id":"4","year":"2","subject_image":"applied-maths.jpg","description":"This subject intends to teach students basic facts, concepts, principles and procedure of Mathematics as a tool to analyze Engineering problems and as such it lays down foundation for the understanding of engineering science and core technology subjects.","level":false},
{"id":"107","name":"Electrification of buildings","department_id":"7","year":"2","subject_image":"electification of building.jfif","description":" In buildings, electrification involves substituting electric technologies for combustion-fueled technologies for end uses where other fuels are being used — most notably, space heating and water heating. ... In buildings, electric alternatives exist for all major energy end uses.","level":false},
{"id":"108","name":"Applied Mathematics – III","department_id":"4","year":"1","subject_image":"applied-maths.jpg","description":"The student shall learn various techniques in integration and differential equations and use these techniques to their related Engineering problems","level":false},
{"id":"109","name":"Engineering Mechanics","department_id":"4","year":"1","subject_image":"Engineering Mechanics.jpg","description":"The fundamental concepts to be studied in this course are required for study of Strength of Materials, Mechanics of Structures and other courses of Mechanical & Civil Engineering to be studied at higher level.","level":false},
{"id":"110","name":"Chemistry","department_id":"4","year":"1","subject_image":"chemistry.jpg","description":"Applications of Material Science and Chemical Principles have resulted into the Development of new materials used in modern medicines and automobiles, synthetic fibers polymers, alloys, new energy sources and many other important products and processes.","level":false},
{"id":"111","name":"Communication Skills","department_id":"4","year":"1","subject_image":"Communication Skills.jpg","description":"Classified under human sciences this subject is intended to introduce students with the process of communication so that they can identify conditions favorable to effective communication.","level":false},
{"id":"112","name":"Electronic circuits and networks","department_id":"6","year":"2","subject_image":"electronic circuits and network.JPG","description":"In electronics, a circuit is a path between two or more points along which an electrical current can be carried. ... A network is an arrangement of circuits. In a dial-up (switched) connection, a circuit is reserved for use by one user for the duration of the calling session.","level":false},
{"id":"113","name":"Engineering Graphics","department_id":"4","year":"1","subject_image":"engineering graphics.jpg","description":"Engineering drawing is the graphical language. It is used by engineers, designers, planners, supervisors and also the workers to express their thoughts, ideas and concepts. The expression by drawing is very accurate, precise and brief.","level":false},
{"id":"114","name":"Workshop Practice","department_id":"4","year":"1","subject_image":"workshop practice.jpg","description":"To make the students conversant with use of various workshop tools  used in smithy, carpentry, fitting, welding and plumbing shops.","level":false},
{"id":"115","name":"ICT","department_id":"4","year":"1","subject_image":"ict.jpg","description":"A program in information and communication technology seeks to prepare students to work in an increasingly complex and fast-paced world.  Scholars learn from professionals about the concepts of communication from relevant case studies from the real-life business community.","level":false},
{"id":"116","name":"Electrical estimation and cost","department_id":"7","year":"2","subject_image":"electrical estimation cost.jpg","description":"Electrical estimating is a process used by electricians, construction managers and engineers to determine the amount and cost of electricity required for a specific location or process. ... The software is preprogrammed with all the safety limits and requirements surrounding electrical wiring.","level":false},
{"id":"117","name":"Consumer Electronics","department_id":"6","year":"2","subject_image":"consumer electronics.JPG","description":"The objective of teaching this subject is to give students an in depth knowledge of various electronic audio and video devices and systems. Further this subject will introduce the students with working principles, block diagram, main features of consumer electronics gadgets\/goods\/devices like audio-systems, CD systems.","level":false},
{"id":"118","name":"Energy audit and conservation","department_id":"7","year":"2","subject_image":"energy audit and conservation.jpg","description":" An energy audit is an inspection survey and an analysis of energy flows for energy conservation in a building. It may include a process or system to reduce the amount of energy input into the system without negatively affecting the output.","level":false},
{"id":"119","name":"Elements of Electronics Engineering","department_id":"4","year":"1","subject_image":"Elements of Electronics Engineering.jpg","description":"This course will be useful in understanding of construction, working and applications of semiconductor devices and circuits.","level":false},
{"id":"120","name":"Electrical circuit analysis","department_id":"7","year":"2","subject_image":"electrical analysis.jpg","description":" It is the process of studying and analyzing electrical quantities through calculations. By this analysis, we can find the unknown elements of a circuit, such as voltage, current, resistance, impedance, power, among others, across its component.","level":false},
{"id":"121","name":"Engineering Physics","department_id":"4","year":"1","subject_image":"Engineering Physics.jpg","description":"The different principles of physics have a wide range of applications in all the braches of engineering. A reasonably good level of knowledge of physics, therefore, forms sound base for engineering students. Physics can be considered as a basic tool in the hands of an engineer through which he can purse his studies and research work in technical field.","level":false},
{"id":"122","name":"Programming in ‘C’","department_id":"4","year":"2","subject_image":"Programming in ‘C’.png","description":"In this era of high speed computing, it is necessary to program computers with the help of structured & dynamic languages like C to study programming is useful in solving problems\/tasks related to various domains. Now days almost every setup in software engineering domain chooses C as a basic tool to develop software.","level":false},
{"id":"123","name":"Strength of Materials","department_id":"4","year":"2","subject_image":"Strength of Materials.jpg","description":"Analysis of forces on the members of structures & machines. Determination of various stresses induced in the materials due to different types of forces.","level":false},
{"id":"124","name":"Machine Drawing","department_id":"4","year":"2","subject_image":"Machine Drawing.jpg","description":"The quality & productivity depends mainly on the ability of Technician to communicate through drawing. The drawing prepared must be clear and it should not have any scope for different interpretations. Machine drawing is more of a performance based rather than knowledge based.","level":false},
{"id":"125","name":"Theory of Machines and Mechanisms","department_id":"4","year":"2","subject_image":"Theory of Machines and Mechanisms.png","description":"The subject deals with geometry of mechanism as well as the forces acting, acceleration of links, inversion of mechanisms different power drives, power transmitting equipment.","level":false},
{"id":"126","name":"Fundamentals of Mechatronics","department_id":"4","year":"2","subject_image":"Fundamentals of Mechatronics.png","description":"This course is being introduced so as to enable the students to get the knowledge & design of robots & various mechatronics systems.","level":false},
{"id":"127","name":"Computer Aided Drafting","department_id":"4","year":"2","subject_image":"Computer Aided Drafting.jpg","description":"Purpose of this course is to teach students the importance of AutoCAD, general specifications and their configurations, system commands and  their utilities and to draw different drawings by using computer aided drafting.","level":false},
{"id":"128","name":"Mechanical Engineering Materials","department_id":"4","year":"2","subject_image":"Mechanical Engineering Materials.jpg","description":"This course in engineering materials is a part of acquiring basic and essential knowledge about materials being used in engineering products and industry","level":false},
{"id":"129","name":"Metrology and Measurements","department_id":"4","year":"2","subject_image":"Metrology and Measurements.jpg","description":"The course has been included in the curriculum as inspection and quality control activities are given prime importance in industry. A diploma technician working in the industry has to identify the variables to be measured, decide the accuracy required, Select the instrument, investigate reasons for defects and give suggestions, decide whether to accept or reject the jobs.","level":false},
{"id":"130","name":"Manufacturing Processes","department_id":"4","year":"2","subject_image":"Manufacturing Processes.jpg","description":"To enable the students to : Understand construction and working of various conventional machine tools Understand various manufacturing processes performed by them. Use of various cutting tools.","level":false},
{"id":"131","name":"Environmental Science ","department_id":"4","year":"2","subject_image":"Environmental Science.jpg","description":"This course has been introduced to make young engineers aware of the relation between society and environment; the global environmental issues, etc. To motivate them for environmental management and to adopt sustainable development practices.","level":false},
{"id":"132","name":"Industrial Organization and Management","department_id":"4","year":"2","subject_image":"Industrial Organization and Management.jpg","description":"There are various roles of diploma engineers at different levels of technical and administration departments in an industry. They must be aware of financing agencies, Market survey, marketing techniques, human relations management and different acts by which the industries are governed.","level":false},
{"id":"133","name":"Material Management","department_id":"4","year":"2","subject_image":"material-management.jpg","description":"This course deals with management of materials. Smooth running of any industry depends upon the interdepartmental relations and planning for execution of work jointly. Efficiency of production department also depends upon the availability of raw material of required quality and quantity.","level":false},
{"id":"134","name":"Renewable Energy Technologies","department_id":"4","year":"2","subject_image":"Renewable Energy Technologies.jpg","description":"The use of alternative energy source is increasing day by day. Diploma Engineers are to develop, operate and maintain these systems therefore essential to know basics of energy conversion, conservation, energy audit and waste heat recovery techniques.","level":false},
{"id":"135","name":"Engineering Economics","department_id":"4","year":"2","subject_image":"Engineering Economics.png","description":"Diploma Engineers often have to take business decisions, for which they are required to apply economic concepts, logic, tools of analysis and economic theories as they advance in their carrier. It is for this reason that diploma students are required to posses some working knowledge of economic concepts","level":false},
{"id":"136","name":"Ethical Sourcing and Sustainability","department_id":"4","year":"2","subject_image":"Ethical Sourcing and Sustainability.jpg","description":" The course creates awareness on ethical manner of production, including the supply chain, the environmental and social impacts of the production process and product as well as the safety and fair deal towards the work force involved at all levels.","level":false},
{"id":"137","name":"Digital Marketing","department_id":"4","year":"2","subject_image":"digital marketing.jpg","description":"The objective of digital marketing is to develop strong and innovative strategies to promote the business brand, products, and services.","level":false},
{"id":"138","name":"Entrepreneurship and Startup","department_id":"4","year":"2","subject_image":"Entrepreneurship and Startup.jpg","description":" This course aims to develop the competency and the related outcomes in order to start small enterprises. Government of India also motivates the young engineers to come up with new idea to promote Start ups.","level":false},
{"id":"139","name":"Disaster Management","department_id":"4","year":"2","subject_image":"Disaster Management.png","description":"A diploma holder in any discipline has a greater role in disaster management owing to the technical skill sets possessed by him\/her. The course is an attempt to sensitize the students pursuing diploma programme in Engineering \/ Technology about various aspects of Disaster management.","level":false},
{"id":"140","name":"Quality Techniques","department_id":"4","year":"2","subject_image":"Quality Techniques.jpg","description":"Mechanical Engineers must have consciousness about various quality aspects required for manufacturing \/service sector. To fulfill this need, this subject about various factors and philosophies in quality development is introduced. ","level":false},
{"id":"141","name":"Power Engineering","department_id":"4","year":"2","subject_image":"Power Engineering.jpg","description":"Students will be able to understand: Working of different types of I.C. engines and their sub systems, air compressors, gas turbines, various refrigeration systems and their applications, etc.","level":false},
{"id":"142","name":"Industrial Hydraulics and Pneumatics","department_id":"4","year":"2","subject_image":"hydralic vs pneumatic.jfif","description":"Understanding of fundamental principles, construction and working of elements of hydraulic and pneumatic control systems helps a Diploma technician in operation, maintenance and erection of modern machine tools. Practical circuits and PLC ladder diagrams are also dealt so that student is familiar with the industrial automation","level":false},
{"id":"143","name":"Machine Design","department_id":"4","year":"2","subject_image":"Machine Design.jpg","description":"Design office of Industry is one of the major job areas for Diploma Technicians. To enable a student to work there he should know how to design the simple machine elements. He should also be aware of economic considerations and usual design procedures and selection of appropriate material.","level":false},
{"id":"144","name":"Production Technology ","department_id":"4","year":"2","subject_image":"Production Technology.jpg","description":"Student should be trained about wide range of production processes involved for mass production of engineering components needs to be employed with due consideration of functional and economical aspects.","level":false},
{"id":"145","name":"Computer aided 3D Modeling","department_id":"4","year":"2","subject_image":"Computer aided 3D Modeling..jpg","description":"This course deals with concepts of solid modeling to enhance modeling skills of diploma students.","level":false},
{"id":"146","name":"Refrigeration and Air Conditioning","department_id":"4","year":"2","subject_image":"Refrigeration and Air Conditioning.jpg","description":"Considering the wide and increasing use of Refrigeration and Air conditioning for domestic and commercial applications and the challenges put by the use of Refrigeration and air conditioning equipments in existing stage, it is absolutely necessary that Diploma technicians should learn this course.","level":false},
{"id":"147","name":"Automobile Engineering","department_id":"4","year":"2","subject_image":"Automobile Engineering.png","description":"This course aims to : Make the student capable to work in various shops of an automobile industry, create consciousness about problems created  due to wide use of automobiles, create awareness about new standards used in modern automobile industry.","level":false},
{"id":"148","name":"Tool Engineering","department_id":"4","year":"2","subject_image":"Tool Engineering.jpeg","description":"This course is introduced so as to enable the students to get the knowledge of cutting tools , jigs and fixtures etc. to enter into the practical field of engineering.","level":false},
{"id":"149","name":"Advanced Manufacturing and CNC","department_id":"4","year":"2","subject_image":"Advanced Manufacturing and CNC.jpg","description":"Student should be made aware of new developments in the area of Manufacturing so as to acquire proficiency in handling new machine tools and equipments such as CNC, FMS, AUTOMATION KITS, JIT & Lean manufacturing.","level":false},
{"id":"150","name":"Audio Video Engineering","department_id":"6","year":"2","subject_image":"audio video.jpg","description":"The audio\/video (AV) engineer oversees the setting up, configuration, and maintenance of multimedia systems such as cameras, lighting, microphones, and control systems for a company. ","level":false},
{"id":"151","name":"Principles of communication","department_id":"6","year":"2","subject_image":"principle of communication.tif","description":"Principles of Effective Communication – Clarity in Ideas, Appropriate Language, Attention, Consistency, Adequacy, Proper Time, Informality, Feedback and a Few Others. The chief purpose of communication is the exchange of ideas among various people working in the organisation.","level":false},
{"id":"152","name":"Electrical materials and workshop","department_id":"7","year":"2","subject_image":"electrical materials and workshop.JPG","description":"Introduction, Tools and Precautions – Workshop Practical. Electrical engineering is an engineering discipline concerned with the study, design and application of equipment, devices and systems which use electricity, electronics, and electromagnetism.","level":false},
{"id":"153","name":"Switchgear and protection","department_id":"7","year":"2","subject_image":"switchgear and protection.jpg","description":"In an electric power system, switchgear is composed of electrical disconnect switches, fuses or circuit breakers used to control, protect and isolate electrical equipment. Switchgear is used both to de-energize equipment to allow work to be done and to clear faults downstream.","level":false},
{"id":"154","name":"Embedded system technology","department_id":"6","year":"2","subject_image":"embedded system technology.png","description":" Embedded systems are special-purpose computing systems embedded in application environments or in other computing systems and provide specialized support.","level":false},
{"id":"155","name":"Industrial automation","department_id":"6","year":"2","subject_image":"industrial automation.JPG","description":"This course provides an overall exposure to the technology of Industrial Automation and Control as widely seen in factories of all types both for discrete and continuous manufacturing.","level":false},
{"id":"156","name":"Industrial automation","department_id":"7","year":"2","subject_image":"industrial automation.JPG","description":"This course provides an overall exposure to the technology of Industrial Automation and Control as widely seen in factories of all types both for discrete and continuous manufacturing.","level":false},
{"id":"157","name":"Programming in C","department_id":"6","year":"2","subject_image":"programming in c.jpg","description":"C is a general-purpose language that most programmers learn before moving on to more complex languages. ... It is easy to learn","level":false},
{"id":"158","name":"AC machine","department_id":"7","year":"2","subject_image":"ac machines.png","description":"This course presents a thorough treatment of AC machine design, ... a machine without interfering with the initial comprehension of the core subject matter","level":false},
{"id":"159","name":"Basic Electrical Engineering","department_id":"7","year":"2","subject_image":"basic elec engineering.jpg","description":"Basic Electrical engineering is an engineering discipline concerned with the study, design and application of equipment, devices and systems which use electricity, electronics, and electromagnetism.","level":false},
{"id":"160","name":"Electrical Technology","department_id":"7","year":"2","subject_image":"electrical technology.jpg","description":"The course can be broadly divided into 3 major parts, namely: Electrical circuits, Electrical Machines and Measuring instruments.","level":false},
{"id":"161","name":"Electronic components and circuits","department_id":"6","year":"2","subject_image":"electric components and circuits.png","description":"An electronic circuit is composed of individual electronic components, such as resistors, transistors, capacitors, inductors and diodes, connected by conductive wires or traces through which electric current can flow.","level":false},
{"id":"162","name":"Fundamentals Of Electrical Engineering ","department_id":"7","year":"2","subject_image":"fundamental of electrical engineering.jpg","description":"The basic concepts of DC and AC ( Single Phase and Three Phase Circuits ) network analysis, first order DC transients, steady state and phasor analysis of AC ","level":false},
{"id":"163","name":"Electronic instrumentation","department_id":"6","year":"2","subject_image":"electronic instrumentation.jpg","description":"Apart from covering core subjects such as Industrial Instrumentation, Measurements, Sensors & Transducers, Process Control, Bio-Medical Instrumentation and Robotics, students deal with software and hardware topics such as Microprocessor and Microcontroller-based instrumentation, VLSI and Embedded System designs","level":false},
{"id":"164","name":"Elements Of Electronic Engineering ","department_id":"6","year":"2","subject_image":"elements of electronic engineering.jpg","description":"Electronic engineering involves the design and testing of electronic circuits that use the properties of components such as resistors, capacitors, inductors, diodes, and transistors to achieve a particular functionality.","level":false},
{"id":"165","name":"Optical Communication","department_id":"6","year":"2","subject_image":"optical communication.jpg","description":" Optical communication, also known as optical telecommunication, is communication at a distance using light to carry information. It can be performed visually or by using electronic devices.","level":false},
{"id":"166","name":"Basic Electronic Engineering","department_id":"6","year":"2","subject_image":"basic electronic engineering.jpg","description":"Electronic engineering (also called electronics and communications engineering) is an electrical engineering discipline which utilizes nonlinear and active electrical components (such as semiconductor devices, especially transistors and diodes) to design electronic circuits","level":false},
{"id":"167","name":"Peripheral interface controller","department_id":"6","year":"2","subject_image":"peripheral.jpg","description":" PIC microcontrollers are a family of specialized microcontroller chips produced by Microchip Technology in Chandler, Arizona. The acronym PIC stands for \"peripheral interface controller,\" although that term is rarely used nowadays.","level":false},
{"id":"168","name":"Power electronics and drives","department_id":"7","year":"2","subject_image":"power electronics and drives.jpg","description":"The subjects which are taught under Power Electronics and Drives are Power Electronic Converters and Machine Drives, Machine Analysis, Power Electronics and Machine Lab, Advanced Machine Drives, and Advanced Power Electronic Converters.","level":false},
{"id":"169","name":"Digital Electronics and microprocessors","department_id":"6","year":"2","subject_image":"digital electronics and mp.JPG","description":" The initial simplicity of the microprocessor is often lost when the engineer finds that microprocessors are usually embedded in conventional digital electronic circuits. ... The central processor, when implemented as a single semicon- ductor chip is called a microprocessor.","level":false},
{"id":"170","name":"Material testing and quality assurance","department_id":"5","year":"2","subject_image":"material_testing_and_quality_assurance_meta.jpg","description":"It is a well-established technique used to determine the physical and mechanical properties of the composite materials like cement, aggregate, steel, etc. used for construction purposes.","level":false},
{"id":"171","name":"Metallurgical analysis","department_id":"5","year":"2","subject_image":"Metallurgical_analysis_meta.jpg","description":"Metallurgical analysis reveals the condition and makeup of your materials with macro, micro and SEM examinations. These analyses reveal microstructure, processes performed on the material during manufacture and whether or not the materials meet the required specification(s) to ensure durability in the intended use.","level":false},
{"id":"172","name":"Advanced physical metallurgy","department_id":"5","year":"3","subject_image":"advanced_physical_metallurgy_mata.png","description":"The main focus of this course is to give the essence of materials science and advanced physical metallurgy, fostering students to understand the links associated with compositions, structures, material processing and their properties on a fundamental level.","level":false},
{"id":"173","name":"Basic Metallurgy ","department_id":"5","year":"2","subject_image":"basic_metallurgy_meta.jpg","description":"Metallurgy is a domain of materials science and enginerring that studies the physical and chemical behavior of metallic elements ,  their inter-metallic compounds, and their mixtures, which are called alloys. Metallurgy encompasses both the science and the tecchnology of metals.","level":false},
{"id":"174","name":"Iron making","department_id":"5","year":"2","subject_image":"iron_making_meta.jpg","description":"The primary objective of iron making is to release iron from chemical combination with oxygen, and, since the blast furnace is much the most efficient process, it receives the most attention here. A third group of iron-making techniques classed as smelting-reduction is still in its infancy","level":false},
{"id":"175","name":"Mechanical engineering materials","department_id":"5","year":"2","subject_image":"mechinacal_enginnering_materials.jpg","description":"Materials engineering covers materials design, properties and use of materials in manufactured articles. ... The principal topics in mechanical engineering are fluid mechanics, thermodynamics and heat transfer, solid mechanics, manufacturing, energy systems, dynamics and control.","level":false},
{"id":"176","name":"Welding and forming process","department_id":"5","year":"3","subject_image":"welding_froming_process_book.jpg","description":"Welding is a fabrication process whereby two or more parts are fused together by means of heat, pressure or both forming a join as the parts cool. Welding is usually used on metals and thermoplastics but can also be used on wood. The completed welded joint may be referred to as a weldment.","level":false},
{"id":"177","name":"Metal working process","department_id":"5","year":"3","subject_image":"metal_working_process.jpg","description":"Literally hundreds of metalworking processes have been developed for specific applications, but these can be divided into five broad groups: rolling, extrusion, drawing, forging, and sheet-metal forming.","level":false},
{"id":"178","name":"Heat treatment of metals and alloys","department_id":"5","year":"3","subject_image":"heat_treatment_of_alloys.jpg","description":"Heat treatment is a controlled process used to alter the microstructure of metals and alloys such as steel and aluminium to impart properties which benefit the working life of a component, for example increased surface hardness, temperature resistance, ductility and strength.","level":false},
{"id":"179","name":"English","department_id":"2","year":"1","subject_image":"th.jpg","description":" English is a West Germanic language originally spoken by the inhabitants of early medieval England. ","level":false},
{"id":"180","name":"Applied Mathematics 2","department_id":"2","year":"1","subject_image":"maths2.png","description":"It has no generally accepted definition. Mathematicians seek and use patterns to formulate ...","level":false},
{"id":"181","name":"Applied Physics","department_id":"2","year":"1","subject_image":"phy (1).jpg","description":"is the natural science that studies matter, its motion and behavior through space and time, and the related entities of energy and force.","level":false},
{"id":"182","name":"Applied Chemistry","department_id":"2","year":"1","subject_image":"chem.jpg","description":"Chemistry is the scientific study of the properties and behavior of matter. It is a natural science that covers the elements that make up matter to the compounds composed of atoms,","level":false},
{"id":"183","name":"Communication skills","department_id":"2","year":"1","subject_image":"communication.jpg","description":"Communication skills involve the effective and efficient transfer of information. Developing communication skills will help in the interview process and on the job.","level":false},
{"id":"184","name":"Introduction to fashion market","department_id":"8","year":"1","subject_image":"introduction_to_fashion_marketing_ddgm.jpg","description":"Fashion marketing can be viewed from different points of view whether you are a designer, manufacturer, or retailer. Regardless of your point of view, marketing is basically the same. What we need to understand is the purpose of marketing is to successfully exchange product, so that we have an exchange between a vendor and a customer. ","level":false},
{"id":"185","name":"History of Design","department_id":"8","year":"1","subject_image":"history_of_design_ddgm.jpg","description":"Design history is the study of objects of design in their historical and stylistic contexts. With a broad definition, the contexts of design history include the social, the cultural, the economic, the political, the technical and the aesthetic.","level":false},
{"id":"186","name":"Tool engineering","department_id":"8","year":"3","subject_image":"tool_engineering_ddgm.jpg","description":"Tool engineering is a division of industrial engineering whose function is to plan the processes of manufacture, develop the tools and machines, and integrate the facilities required for producing particular products with minimal expenditure of time, labor, and materials","level":false},
{"id":"187","name":"Manufacturing technology","department_id":"8","year":"3","subject_image":"manufacturing_technolgy_ddgm.jpg","description":"Manufacturing technology is a term that can refer to a number of modern methods of science, production, and engineering that assist in industrial production and various manufacturing processes.","level":false}
]

